BlueAndi/vscp-framework/examples/arm/frdm-k64f/vscp_frdm_k64f/board/pin_mux.h
#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_


/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/* PORTC6 (number 78), U8[11]/SW2 */
#define BOARD_SW2_GPIO                                                     GPIOC   /*!< GPIO device name: GPIOC */
#define BOARD_SW2_PORT                                                     PORTC   /*!< PORT device name: PORTC */
#define BOARD_SW2_GPIO_PIN                                                    6U   /*!< PORTC pin index: 6 */
#define BOARD_SW2_PIN_NAME                                                  PTC6   /*!< Pin name */
#define BOARD_SW2_LABEL                                             "U8[11]/SW2"   /*!< Label */
#define BOARD_SW2_NAME                                                     "SW2"   /*!< Identifier name */
#define BOARD_SW2_DIRECTION                              kPIN_MUX_DirectionInput   /*!< Direction */

/* PORTA4 (number 38), SW3 */
#define BOARD_SW3_GPIO                                                     GPIOA   /*!< GPIO device name: GPIOA */
#define BOARD_SW3_PORT                                                     PORTA   /*!< PORT device name: PORTA */
#define BOARD_SW3_GPIO_PIN                                                    4U   /*!< PORTA pin index: 4 */
#define BOARD_SW3_PIN_NAME                                                  PTA4   /*!< Pin name */
#define BOARD_SW3_LABEL                                                    "SW3"   /*!< Label */
#define BOARD_SW3_NAME                                                     "SW3"   /*!< Identifier name */
#define BOARD_SW3_DIRECTION                              kPIN_MUX_DirectionInput   /*!< Direction */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitButtons(void);

/* PORTB21 (number 67), D12[3]/LEDRGB_BLUE */
#define BOARD_LED_BLUE_GPIO                                                GPIOB   /*!< GPIO device name: GPIOB */
#define BOARD_LED_BLUE_PORT                                                PORTB   /*!< PORT device name: PORTB */
#define BOARD_LED_BLUE_GPIO_PIN                                              21U   /*!< PORTB pin index: 21 */
#define BOARD_LED_BLUE_PIN_NAME                                            PTB21   /*!< Pin name */
#define BOARD_LED_BLUE_LABEL                                "D12[3]/LEDRGB_BLUE"   /*!< Label */
#define BOARD_LED_BLUE_NAME                                           "LED_BLUE"   /*!< Identifier name */
#define BOARD_LED_BLUE_DIRECTION                        kPIN_MUX_DirectionOutput   /*!< Direction */

/* PORTB22 (number 68), D12[1]/LEDRGB_RED */
#define BOARD_LED_RED_GPIO                                                 GPIOB   /*!< GPIO device name: GPIOB */
#define BOARD_LED_RED_PORT                                                 PORTB   /*!< PORT device name: PORTB */
#define BOARD_LED_RED_GPIO_PIN                                               22U   /*!< PORTB pin index: 22 */
#define BOARD_LED_RED_PIN_NAME                                             PTB22   /*!< Pin name */
#define BOARD_LED_RED_LABEL                                  "D12[1]/LEDRGB_RED"   /*!< Label */
#define BOARD_LED_RED_NAME                                             "LED_RED"   /*!< Identifier name */
#define BOARD_LED_RED_DIRECTION                         kPIN_MUX_DirectionOutput   /*!< Direction */

/* PORTE26 (number 33), J2[1]/D12[4]/LEDRGB_GREEN */
#define BOARD_LED_GREEN_GPIO                                               GPIOE   /*!< GPIO device name: GPIOE */
#define BOARD_LED_GREEN_PORT                                               PORTE   /*!< PORT device name: PORTE */
#define BOARD_LED_GREEN_GPIO_PIN                                             26U   /*!< PORTE pin index: 26 */
#define BOARD_LED_GREEN_PIN_NAME                                           PTE26   /*!< Pin name */
#define BOARD_LED_GREEN_LABEL                        "J2[1]/D12[4]/LEDRGB_GREEN"   /*!< Label */
#define BOARD_LED_GREEN_NAME                                         "LED_GREEN"   /*!< Identifier name */
#define BOARD_LED_GREEN_DIRECTION                       kPIN_MUX_DirectionOutput   /*!< Direction */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDs(void);

/* PORTB17 (number 63), U10[1]/UART0_TX */
#define BOARD_DEBUG_UART_TX_PERIPHERAL                                     UART0   /*!< Device name: UART0 */
#define BOARD_DEBUG_UART_TX_SIGNAL                                            TX   /*!< UART0 signal: TX */
#define BOARD_DEBUG_UART_TX_PIN_NAME                                    UART0_TX   /*!< Pin name */
#define BOARD_DEBUG_UART_TX_LABEL                              "U10[1]/UART0_TX"   /*!< Label */
#define BOARD_DEBUG_UART_TX_NAME                                 "DEBUG_UART_TX"   /*!< Identifier name */
#define BOARD_DEBUG_UART_TX_DIRECTION                   kPIN_MUX_DirectionOutput   /*!< Direction */

/* PORTB16 (number 62), U7[4]/UART0_RX */
#define BOARD_DEBUG_UART_RX_PERIPHERAL                                     UART0   /*!< Device name: UART0 */
#define BOARD_DEBUG_UART_RX_SIGNAL                                            RX   /*!< UART0 signal: RX */
#define BOARD_DEBUG_UART_RX_PIN_NAME                                    UART0_RX   /*!< Pin name */
#define BOARD_DEBUG_UART_RX_LABEL                               "U7[4]/UART0_RX"   /*!< Label */
#define BOARD_DEBUG_UART_RX_NAME                                 "DEBUG_UART_RX"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UART(void);

/* PORTA18 (number 50), U13[16]/RMII_RXCLK */
#define BOARD_EXTAL0_PERIPHERAL                                              OSC   /*!< Device name: OSC */
#define BOARD_EXTAL0_SIGNAL                                               EXTAL0   /*!< OSC signal: EXTAL0 */
#define BOARD_EXTAL0_PIN_NAME                                             EXTAL0   /*!< Pin name */
#define BOARD_EXTAL0_LABEL                                  "U13[16]/RMII_RXCLK"   /*!< Label */
#define BOARD_EXTAL0_NAME                                               "EXTAL0"   /*!< Identifier name */

/* EXTAL32 (number 29), Y3[2]/EXTAL32_RTC */
#define BOARD_ETAL32K_PERIPHERAL                                             RTC   /*!< Device name: RTC */
#define BOARD_ETAL32K_SIGNAL                                             EXTAL32   /*!< RTC signal: EXTAL32 */
#define BOARD_ETAL32K_PIN_NAME                                           EXTAL32   /*!< Pin name */
#define BOARD_ETAL32K_LABEL                                  "Y3[2]/EXTAL32_RTC"   /*!< Label */
#define BOARD_ETAL32K_NAME                                             "ETAL32K"   /*!< Identifier name */

/* XTAL32 (number 28), Y3[1]/XTAL32_RTC */
#define BOARD_XTAL32K_PERIPHERAL                                             RTC   /*!< Device name: RTC */
#define BOARD_XTAL32K_SIGNAL                                              XTAL32   /*!< RTC signal: XTAL32 */
#define BOARD_XTAL32K_PIN_NAME                                            XTAL32   /*!< Pin name */
#define BOARD_XTAL32K_LABEL                                   "Y3[1]/XTAL32_RTC"   /*!< Label */
#define BOARD_XTAL32K_NAME                                             "XTAL32K"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitOSC(void);

/* PORTE25 (number 32), J2[18]/U8[6]/I2C0_SDA */
#define BOARD_ACCEL_SDA_PERIPHERAL                                          I2C0   /*!< Device name: I2C0 */
#define BOARD_ACCEL_SDA_SIGNAL                                               SDA   /*!< I2C0 signal: SDA */
#define BOARD_ACCEL_SDA_PIN_NAME                                        I2C0_SDA   /*!< Pin name */
#define BOARD_ACCEL_SDA_LABEL                            "J2[18]/U8[6]/I2C0_SDA"   /*!< Label */
#define BOARD_ACCEL_SDA_NAME                                         "ACCEL_SDA"   /*!< Identifier name */

/* PORTE24 (number 31), J2[20]/U8[4]/I2C0_SCL */
#define BOARD_ACCEL_SCL_PERIPHERAL                                          I2C0   /*!< Device name: I2C0 */
#define BOARD_ACCEL_SCL_SIGNAL                                               SCL   /*!< I2C0 signal: SCL */
#define BOARD_ACCEL_SCL_PIN_NAME                                        I2C0_SCL   /*!< Pin name */
#define BOARD_ACCEL_SCL_LABEL                            "J2[20]/U8[4]/I2C0_SCL"   /*!< Label */
#define BOARD_ACCEL_SCL_NAME                                         "ACCEL_SCL"   /*!< Identifier name */

