BlueAndi/vscp-framework/examples/arm/frdm-k64f/vscp_frdm_k64f/board/pin_mux.h
/* PORTC6 (number 78), U8[11]/SW2 */
#define BOARD_ACCEL_INT1_GPIO                                              GPIOC   /*!< GPIO device name: GPIOC */
#define BOARD_ACCEL_INT1_PORT                                              PORTC   /*!< PORT device name: PORTC */
#define BOARD_ACCEL_INT1_GPIO_PIN                                             6U   /*!< PORTC pin index: 6 */
#define BOARD_ACCEL_INT1_PIN_NAME                                           PTC6   /*!< Pin name */
#define BOARD_ACCEL_INT1_LABEL                                      "U8[11]/SW2"   /*!< Label */
#define BOARD_ACCEL_INT1_NAME                                       "ACCEL_INT1"   /*!< Identifier name */
#define BOARD_ACCEL_INT1_DIRECTION                       kPIN_MUX_DirectionInput   /*!< Direction */

/* PORTC13 (number 85), U8[9] */
#define BOARD_ACCEL_INT2_GPIO                                              GPIOC   /*!< GPIO device name: GPIOC */
#define BOARD_ACCEL_INT2_PORT                                              PORTC   /*!< PORT device name: PORTC */
#define BOARD_ACCEL_INT2_GPIO_PIN                                            13U   /*!< PORTC pin index: 13 */
#define BOARD_ACCEL_INT2_PIN_NAME                                          PTC13   /*!< Pin name */
#define BOARD_ACCEL_INT2_LABEL                                           "U8[9]"   /*!< Label */
#define BOARD_ACCEL_INT2_NAME                                       "ACCEL_INT2"   /*!< Identifier name */
#define BOARD_ACCEL_INT2_DIRECTION                       kPIN_MUX_DirectionInput   /*!< Direction */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitACCEL(void);

/* PORTB1 (number 54), U13[11]/RMII0_MDC */
#define BOARD_RMII0_MDC_PERIPHERAL                                          ENET   /*!< Device name: ENET */
#define BOARD_RMII0_MDC_SIGNAL                                          RMII_MDC   /*!< ENET signal: RMII_MDC */
#define BOARD_RMII0_MDC_PIN_NAME                                       RMII0_MDC   /*!< Pin name */
#define BOARD_RMII0_MDC_LABEL                                "U13[11]/RMII0_MDC"   /*!< Label */
#define BOARD_RMII0_MDC_NAME                                         "RMII0_MDC"   /*!< Identifier name */

/* PORTB0 (number 53), U13[10]/RMII0_MDIO */
#define BOARD_RMII0_MDIO_PERIPHERAL                                         ENET   /*!< Device name: ENET */
#define BOARD_RMII0_MDIO_SIGNAL                                        RMII_MDIO   /*!< ENET signal: RMII_MDIO */
#define BOARD_RMII0_MDIO_PIN_NAME                                     RMII0_MDIO   /*!< Pin name */
#define BOARD_RMII0_MDIO_LABEL                              "U13[10]/RMII0_MDIO"   /*!< Label */
#define BOARD_RMII0_MDIO_NAME                                       "RMII0_MDIO"   /*!< Identifier name */

/* PORTA13 (number 43), U13[13]/RMII0_RXD_0 */
#define BOARD_RMII0_RXD0_PERIPHERAL                                         ENET   /*!< Device name: ENET */
#define BOARD_RMII0_RXD0_SIGNAL                                        RMII_RXD0   /*!< ENET signal: RMII_RXD0 */
#define BOARD_RMII0_RXD0_PIN_NAME                                     RMII0_RXD0   /*!< Pin name */
#define BOARD_RMII0_RXD0_LABEL                             "U13[13]/RMII0_RXD_0"   /*!< Label */
#define BOARD_RMII0_RXD0_NAME                                       "RMII0_RXD0"   /*!< Identifier name */

/* PORTA12 (number 42), U13[12]/RMII0_RXD_1 */
#define BOARD_RMII0_RXD1_PERIPHERAL                                         ENET   /*!< Device name: ENET */
#define BOARD_RMII0_RXD1_SIGNAL                                        RMII_RXD1   /*!< ENET signal: RMII_RXD1 */
#define BOARD_RMII0_RXD1_PIN_NAME                                     RMII0_RXD1   /*!< Pin name */
#define BOARD_RMII0_RXD1_LABEL                             "U13[12]/RMII0_RXD_1"   /*!< Label */
#define BOARD_RMII0_RXD1_NAME                                       "RMII0_RXD1"   /*!< Identifier name */

/* PORTA5 (number 39), U13[17]/RMII0_RXER */
#define BOARD_RMII0_RXER_PERIPHERAL                                         ENET   /*!< Device name: ENET */
#define BOARD_RMII0_RXER_SIGNAL                                        RMII_RXER   /*!< ENET signal: RMII_RXER */
#define BOARD_RMII0_RXER_PIN_NAME                                     RMII0_RXER   /*!< Pin name */
#define BOARD_RMII0_RXER_LABEL                              "U13[17]/RMII0_RXER"   /*!< Label */
#define BOARD_RMII0_RXER_NAME                                       "RMII0_RXER"   /*!< Identifier name */

/* PORTA16 (number 46), U13[20]/RMII0_TXD0 */
#define BOARD_RMII0_TXD0_PERIPHERAL                                         ENET   /*!< Device name: ENET */
#define BOARD_RMII0_TXD0_SIGNAL                                        RMII_TXD0   /*!< ENET signal: RMII_TXD0 */
#define BOARD_RMII0_TXD0_PIN_NAME                                     RMII0_TXD0   /*!< Pin name */
#define BOARD_RMII0_TXD0_LABEL                              "U13[20]/RMII0_TXD0"   /*!< Label */
#define BOARD_RMII0_TXD0_NAME                                       "RMII0_TXD0"   /*!< Identifier name */

/* PORTA17 (number 47), U13[21]/RMII0_TXD1 */
#define BOARD_RMII0_TXD1_PERIPHERAL                                         ENET   /*!< Device name: ENET */
#define BOARD_RMII0_TXD1_SIGNAL                                        RMII_TXD1   /*!< ENET signal: RMII_TXD1 */
#define BOARD_RMII0_TXD1_PIN_NAME                                     RMII0_TXD1   /*!< Pin name */
#define BOARD_RMII0_TXD1_LABEL                              "U13[21]/RMII0_TXD1"   /*!< Label */
#define BOARD_RMII0_TXD1_NAME                                       "RMII0_TXD1"   /*!< Identifier name */

/* PORTA15 (number 45), U13[19]/RMII0_TXEN */
#define BOARD_RMII0_TXEN_PERIPHERAL                                         ENET   /*!< Device name: ENET */
#define BOARD_RMII0_TXEN_SIGNAL                                        RMII_TXEN   /*!< ENET signal: RMII_TXEN */
#define BOARD_RMII0_TXEN_PIN_NAME                                     RMII0_TXEN   /*!< Pin name */
#define BOARD_RMII0_TXEN_LABEL                              "U13[19]/RMII0_TXEN"   /*!< Label */
#define BOARD_RMII0_TXEN_NAME                                       "RMII0_TXEN"   /*!< Identifier name */

