BlueAndi/vscp-framework/examples/arm/frdm-k64f/vscp_frdm_k64f/board/pin_mux.h
/* PORTA14 (number 44), U13[15]/RMII0_CRS_DV */
#define BOARD_RMII0_CRS_DV_PERIPHERAL                                       ENET   /*!< Device name: ENET */
#define BOARD_RMII0_CRS_DV_SIGNAL                                    RMII_CRS_DV   /*!< ENET signal: RMII_CRS_DV */
#define BOARD_RMII0_CRS_DV_PIN_NAME                                 RMII0_CRS_DV   /*!< Pin name */
#define BOARD_RMII0_CRS_DV_LABEL                          "U13[15]/RMII0_CRS_DV"   /*!< Label */
#define BOARD_RMII0_CRS_DV_NAME                                   "RMII0_CRS_DV"   /*!< Identifier name */

/* PORTA18 (number 50), U13[16]/RMII_RXCLK */
#define BOARD_RMII_RXCLK_PERIPHERAL                                         ENET   /*!< Device name: ENET */
#define BOARD_RMII_RXCLK_SIGNAL                                       RMII_CLKIN   /*!< ENET signal: RMII_CLKIN */
#define BOARD_RMII_RXCLK_PIN_NAME                                         EXTAL0   /*!< Pin name */
#define BOARD_RMII_RXCLK_LABEL                              "U13[16]/RMII_RXCLK"   /*!< Label */
#define BOARD_RMII_RXCLK_NAME                                       "RMII_RXCLK"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitENET(void);

/* PORTE0 (number 1), J15[P8]/SDHC0_D1 */
#define BOARD_SDHC0_D1_PERIPHERAL                                           SDHC   /*!< Device name: SDHC */
#define BOARD_SDHC0_D1_SIGNAL                                               DATA   /*!< SDHC signal: DATA */
#define BOARD_SDHC0_D1_CHANNEL                                                 1   /*!< SDHC DATA channel: 1 */
#define BOARD_SDHC0_D1_PIN_NAME                                         SDHC0_D1   /*!< Pin name */
#define BOARD_SDHC0_D1_LABEL                                  "J15[P8]/SDHC0_D1"   /*!< Label */
#define BOARD_SDHC0_D1_NAME                                           "SDHC0_D1"   /*!< Identifier name */

/* PORTE1 (number 2), J15[P7]/SDHC0_D0 */
#define BOARD_SDHC0_D0_PERIPHERAL                                           SDHC   /*!< Device name: SDHC */
#define BOARD_SDHC0_D0_SIGNAL                                               DATA   /*!< SDHC signal: DATA */
#define BOARD_SDHC0_D0_CHANNEL                                                 0   /*!< SDHC DATA channel: 0 */
#define BOARD_SDHC0_D0_PIN_NAME                                         SDHC0_D0   /*!< Pin name */
#define BOARD_SDHC0_D0_LABEL                                  "J15[P7]/SDHC0_D0"   /*!< Label */
#define BOARD_SDHC0_D0_NAME                                           "SDHC0_D0"   /*!< Identifier name */

/* PORTE2 (number 3), J15[P5]/SDHC0_DCLK */
#define BOARD_SDHC0_DCLK_PERIPHERAL                                         SDHC   /*!< Device name: SDHC */
#define BOARD_SDHC0_DCLK_SIGNAL                                             DCLK   /*!< SDHC signal: DCLK */
#define BOARD_SDHC0_DCLK_PIN_NAME                                     SDHC0_DCLK   /*!< Pin name */
#define BOARD_SDHC0_DCLK_LABEL                              "J15[P5]/SDHC0_DCLK"   /*!< Label */
#define BOARD_SDHC0_DCLK_NAME                                       "SDHC0_DCLK"   /*!< Identifier name */

/* PORTE3 (number 4), J15[P3]/SDHC0_CMD */
#define BOARD_SDHC0_CMD_PERIPHERAL                                          SDHC   /*!< Device name: SDHC */
#define BOARD_SDHC0_CMD_SIGNAL                                               CMD   /*!< SDHC signal: CMD */
#define BOARD_SDHC0_CMD_PIN_NAME                                       SDHC0_CMD   /*!< Pin name */
#define BOARD_SDHC0_CMD_LABEL                                "J15[P3]/SDHC0_CMD"   /*!< Label */
#define BOARD_SDHC0_CMD_NAME                                         "SDHC0_CMD"   /*!< Identifier name */

/* PORTE4 (number 5), J15[P2]/SDHC0_D3 */
#define BOARD_SDHC0_D3_PERIPHERAL                                           SDHC   /*!< Device name: SDHC */
#define BOARD_SDHC0_D3_SIGNAL                                               DATA   /*!< SDHC signal: DATA */
#define BOARD_SDHC0_D3_CHANNEL                                                 3   /*!< SDHC DATA channel: 3 */
#define BOARD_SDHC0_D3_PIN_NAME                                         SDHC0_D3   /*!< Pin name */
#define BOARD_SDHC0_D3_LABEL                                  "J15[P2]/SDHC0_D3"   /*!< Label */
#define BOARD_SDHC0_D3_NAME                                           "SDHC0_D3"   /*!< Identifier name */

/* PORTE5 (number 6), J15[P1]/SDHC0_D2 */
#define BOARD_SDHC0_D2_PERIPHERAL                                           SDHC   /*!< Device name: SDHC */
#define BOARD_SDHC0_D2_SIGNAL                                               DATA   /*!< SDHC signal: DATA */
#define BOARD_SDHC0_D2_CHANNEL                                                 2   /*!< SDHC DATA channel: 2 */
#define BOARD_SDHC0_D2_PIN_NAME                                         SDHC0_D2   /*!< Pin name */
#define BOARD_SDHC0_D2_LABEL                                  "J15[P1]/SDHC0_D2"   /*!< Label */
#define BOARD_SDHC0_D2_NAME                                           "SDHC0_D2"   /*!< Identifier name */

/* PORTE6 (number 7), J15[G1]/SD_CARD_DETECT */
#define BOARD_SDHC_CD_GPIO                                                 GPIOE   /*!< GPIO device name: GPIOE */
#define BOARD_SDHC_CD_PORT                                                 PORTE   /*!< PORT device name: PORTE */
#define BOARD_SDHC_CD_GPIO_PIN                                                6U   /*!< PORTE pin index: 6 */
#define BOARD_SDHC_CD_PIN_NAME                                              PTE6   /*!< Pin name */
#define BOARD_SDHC_CD_LABEL                             "J15[G1]/SD_CARD_DETECT"   /*!< Label */
#define BOARD_SDHC_CD_NAME                                             "SDHC_CD"   /*!< Identifier name */
#define BOARD_SDHC_CD_DIRECTION                          kPIN_MUX_DirectionInput   /*!< Direction */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDHC(void);

/* USB0_DP (number 10), J22[3]/K64_MICRO_USB_DP */
#define BOARD_USB_DP_PERIPHERAL                                             USB0   /*!< Device name: USB0 */
#define BOARD_USB_DP_SIGNAL                                                   DP   /*!< USB0 signal: DP */
#define BOARD_USB_DP_PIN_NAME                                            USB0_DP   /*!< Pin name */
#define BOARD_USB_DP_LABEL                             "J22[3]/K64_MICRO_USB_DP"   /*!< Label */
#define BOARD_USB_DP_NAME                                               "USB_DP"   /*!< Identifier name */

/* USB0_DM (number 11), J22[2]/K64_MICRO_USB_DN */
#define BOARD_USB_DM_PERIPHERAL                                             USB0   /*!< Device name: USB0 */
#define BOARD_USB_DM_SIGNAL                                                   DM   /*!< USB0 signal: DM */
#define BOARD_USB_DM_PIN_NAME                                            USB0_DM   /*!< Pin name */
#define BOARD_USB_DM_LABEL                             "J22[2]/K64_MICRO_USB_DN"   /*!< Label */
#define BOARD_USB_DM_NAME                                               "USB_DM"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSB(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/*******************************************************************************
 * EOF
 ******************************************************************************/
